; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star8 - direction
	Star10 - direction
	GroundStation13 - direction
	Star14 - direction
	Star1 - direction
	Star9 - direction
	Star0 - direction
	GroundStation5 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star9)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star10)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star14)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
)
(:goal (and
	(have_image Star15 image1)
	(have_image Star16 thermograph2)
	(have_image Star17 thermograph2)
	(have_image Phenomenon18 thermograph0)
	(have_image Planet19 thermograph0)
))

)

; plan
1. (turn_to satellite0 star8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star15 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star15)
   goals met: 0 of 5
5. (take_image satellite0 star15 instrument0 image1)
   added: (have_image star15 image1)
   goals met: 1 of 5
6. (turn_to satellite0 planet19 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet19)
   goals met: 1 of 5
7. (take_image satellite0 planet19 instrument0 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon18 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon18 instrument0 thermograph0)
   added: (have_image phenomenon18 thermograph0)
   goals met: 3 of 5
10. (turn_to satellite0 star16 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 star16)
   goals met: 3 of 5
11. (take_image satellite0 star16 instrument0 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 4 of 5
13. (take_image satellite0 star17 instrument0 thermograph2)
   added: (have_image star17 thermograph2)
   goals met: 5 of 5
